perf/bbox_test.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Start
      duration: 10
      arrivalRate: 0
    - name: Ramp
      duration: 120
      arrivalRate: 1
      rampTo: 30
    - name: Finish
      duration: 10
      arrivalRate: 0
    

scenarios:
  - name: Bbox
    flow:
      - get:
          url: '/bbox2'