perf/load_replicado.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/nodes'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Start
      duration: 10
      arrivalRate: 0
    - name: Warm up
      duration: 30
      arrivalRate: 5
    - name: Ramp
      duration: 40
      arrivalRate: 5
      rampTo: 30
    - name: High Load
      duration: 60
      arrivalRate: 30
    - name: Finish
      duration: 10
      arrivalRate: 0
    

scenarios:
  - name: Load
    flow:
      - get:
          url: '/load'